# =============================================================================
# YOLOv8s-P2-AuxSup-P3Main（GibbonGuard v2：P2 training-only 辅助监督头）
# -----------------------------------------------------------------------------
# 在 aux_p3main(v1) 基础上，把最终 Detect 换成 AuxDetect：
#   - 主检测头：P3/P4/P5（标准 Detect 结构，继承官方 yolov8s 预训练 Detect 头）；
#   - 辅助监督头：P2(stride=4)，**仅训练参与联合 loss，推理/验证/导出时丢弃**；
#   - P2+ResPAM 仍经 bottom-up（19→20→21→22）注入 P3，扮演细节辅助角色。
# AuxDetect 输入 [19, 22, 25, 28] → ch=(P2, P3, P4, P5)；
#   AuxDetect 内部用 ch[1:]=(P3,P4,P5) 构建主头、ch[0]=P2 构建辅助头。
# 联合损失：L = L_main(P3/P4/P5) + w · L_aux(P2)，由 AuxDetectionLoss 计算。
# 设计意图：相比 v1（P2 仅隐式注入），v2 给 P2 显式的小目标/可见区域监督信号，
#   迫使 P2 学到更强的细节响应再注入 P3；推理仍是干净 3 头（与 v1 等价开销）。
# backbone 与官方 YOLOv8s 完全一致（保留预训练语义）。
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 12: P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 15: P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]                 # 18: P2 top-down
  - [-1, 1, ResPAM, [128]]              # 19: ResPAM@P2（注入 P3 + 辅助监督头共用）

  - [-1, 1, Conv, [128, 3, 2]]          # 20: P2 细节下采样→P3 分辨率
  - [[-1, 15], 1, Concat, [1]]          # 21: [P2 detail↓, P3 td]
  - [-1, 3, C2f, [256]]                 # 22: P3 bottom-up（已注入 P2 细节）→ 主检测头

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 25: P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                # 28: P5 bottom-up

  - [[19, 22, 25, 28], 1, AuxDetect, [nc]]   # 主头 P3/P4/P5 + training-only P2 辅助监督头
