# =============================================================================
# YOLOv8s-MonkeyPlus-P2
# -----------------------------------------------------------------------------
# 原则：保留原生 C2f + yolov8s.pt 迁移；无 RST、无全量 C2f_AdaConv。
# 结构：backbone 在 P4→P5 前 1×MSCB；neck 增加 P2 分支（stride≈4）+ 4 尺度 Detect。
# 注意力：各尺度 C2f 后接 PAM（并联注意力）。
#
# Detect 输入层索引（已通过 parse 校验）：P2/P3/P4/P5 → [22, 26, 30, 34]
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, MSCB, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, PAM, [512]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, PAM, [256]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [-1, 1, PAM, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, PAM, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, PAM, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]
  - [-1, 1, PAM, [1024]]

  - [[22, 26, 30, 34], 1, Detect, [nc]]
