# =============================================================================
# YOLOv8s-P2-ResPAM-SGF（方案 A）
# -----------------------------------------------------------------------------
# backbone 与官方 YOLOv8s 一致；P2 head + ResPAM@P2 + P3→P2 语义引导融合 SGF。
# 思路：保留当前最优 ResPAM@P2，再用 P3(bottom-up) 的强语义反向指导 P2，
#       以残差方式抑制人形/树枝/逆光高频误检，而非继续增强 P2 高频。
#   P2_C2f → ResPAM@P2 → SGF([ResPAM@P2, up(P3_bu)]) → Detect(P2)
#   SGF: P2_out = P2 + tanh(beta) * Fuse(P2, up(P3))，beta=0 初态恒等。
# Detect 索引由 parse 校验为 [31, 22, 25, 28]
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 12: P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 15: P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]                 # 18: P2 top-down
  - [-1, 1, ResPAM, [128]]              # 19: ResPAM@P2

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 22: P3 bottom-up

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 25: P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                # 28: P5 bottom-up

  - [22, 1, nn.Upsample, [None, 2, nearest]]   # 29: up(P3 bottom-up) → P2 分辨率
  - [[19, 29], 1, Concat, [1]]                 # 30: [ResPAM@P2, up(P3)]
  - [-1, 1, SGF, [128]]                        # 31: P3→P2 语义引导融合（残差）

  - [[31, 22, 25, 28], 1, Detect, [nc]]
