# =============================================================================
# YOLOv8s-P2-Wide-ResPAM-SGF（预案：加宽 P2 容量，而非加新模块）
# -----------------------------------------------------------------------------
# 在 respam_sgf 基础上把 P2 分支 C2f/ResPAM 由 128→192（s 尺度检测头通道 64→96），
# 以增强 P2 spatial 表达、提升小目标高 IoU 定位质量；其余结构不变。
#   P2_C2f[192] → ResPAM@P2[192] → SGF([ResPAM@P2, up(P3_bu)]) → Detect(P2)
# 关键：SGF 必须同步加宽为 [192]（c2=96），使其内部 p2 切分(96) 恰好对齐 ResPAM 输出(96)，
#       否则 [p2|sem] 通道错位、语义引导失效。
# Detect 索引由 parse 校验为 [31, 22, 25, 28]
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 12: P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 15: P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [192]]                 # 18: P2 top-down (WIDE 128→192)
  - [-1, 1, ResPAM, [192]]              # 19: ResPAM@P2 (WIDE)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 22: P3 bottom-up

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 25: P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                # 28: P5 bottom-up

  - [22, 1, nn.Upsample, [None, 2, nearest]]   # 29: up(P3 bottom-up) → P2 分辨率
  - [[19, 29], 1, Concat, [1]]                 # 30: [ResPAM@P2(96), up(P3)(128)]=224
  - [-1, 1, SGF, [192]]                        # 31: SGF c2=96，p2 切分对齐 ResPAM 输出

  - [[31, 22, 25, 28], 1, Detect, [nc]]
