# =============================================================================
# YOLOv8s-P2-Aux-P3Main（GibbonGuard 纯净版：检测头职责重分配）
# -----------------------------------------------------------------------------
# 核心改动 vs respam_p2only：
#   - 保留 P2 分支 + ResPAM@P2（当前最优模块），并保留其经 Conv↓ 注入 P3 的路径；
#   - **P2 不再作为最终检测头**：Detect 输入由 [19,22,25,28] → [22,25,28]
#     即去掉 stride=4 的 P2 检测头，最终框只由 P3/P4/P5 回归；
#   - P2 的细节通过 bottom-up（layer 19→20→21→22）注入 P3，扮演“细节辅助”角色。
# 设计意图：验证“P2 直接 Detect 带来定位噪声/类人误检”的假设——
#   若 precision↑ 且 mAP50-95↑ 则假设成立；若 recall 暴跌则说明 P2 头对小目标必要。
# 注：本版为“无独立监督的 P2 注入分支”；真正的 P2 辅助监督头(training-only)
#     需改 DetectionModel/loss，属可选第二步，本 YAML 不含。
# backbone 与官方 YOLOv8s 完全一致（保留预训练语义）。
# Detect 索引经 parse 校验应为 [22, 25, 28]（P3/P4/P5）。
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 12: P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                 # 15: P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]                 # 18: P2 top-down
  - [-1, 1, ResPAM, [128]]              # 19: ResPAM@P2（保留；仅作细节注入，不直接 Detect）

  - [-1, 1, Conv, [128, 3, 2]]          # 20: P2 细节下采样→P3 分辨率
  - [[-1, 15], 1, Concat, [1]]          # 21: [P2 detail↓, P3 td]
  - [-1, 3, C2f, [256]]                 # 22: P3 bottom-up（已注入 P2 细节）→ 主检测头

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                 # 25: P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                # 28: P5 bottom-up

  - [[22, 25, 28], 1, Detect, [nc]]     # 最终检测头：仅 P3/P4/P5（去掉 P2 stride=4 头）
