# =============================================================================
# Ablation: yolov8s_ablate_full — 与 cfg/yolov8s-rainforest-paper.yaml 结构等价
# -----------------------------------------------------------------------------
# C2f_AdaConv: 是  |  MSCB: 是  |  PAM: 是（4×）  |  RST: 是（3×，P3/P4/P5）
# Detect 输入: [18, 23, 28]（与论文 YAML 一致；实际以 Ultralytics parse 为准）
# scale: s
# =============================================================================
nc: 1
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f_AdaConv, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f_AdaConv, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f_AdaConv, [512, True]]
  - [-1, 1, MSCB, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f_AdaConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_AdaConv, [512]]
  - [-1, 1, PAM, [512]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_AdaConv, [256]]
  - [-1, 1, PAM, [256]]
  - [-1, 1, RST, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f_AdaConv, [512]]
  - [-1, 1, PAM, [512]]
  - [-1, 1, RST, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f_AdaConv, [1024]]
  - [-1, 1, PAM, [1024]]
  - [-1, 1, RST, [1024]]

  - [[18, 23, 28], 1, Detect, [nc]]
